Autodesk.Revit.DB.Structure.LoadOrientTo
Specifies load orientation.
Since:
2015
Since:
2015

Autodesk.Revit.DB.Structure.LoadOrientTo.HostLocalCoordinateSystem
Load is oriented in respect to it analytical host element coordinate system and will follow host changes.

Autodesk.Revit.DB.Structure.LoadOrientTo.WorkPlane
Load is oriented in respect to work plane.

Autodesk.Revit.DB.Structure.LoadOrientTo.Project
Load is oriented in respect to project global coordinate system, that is X to East, Y to North, and Z to up.